const map = {
  // チーム名
  teamName: [640, 664],
  // オーナー名
  ownerName: [665, 689],
  // 機体が登録されているか
  registered1: [880, 881],
  registered2: [8752, 8753],
  registered3: [16624, 16625],
  // 機体名
  machine1: [1504, 1505],
  machine2: [9376, 9377],
  machine3: [17248, 17249],
  // 各機体の識別名
  machineName1: [884, 908],
  machineName2: [8756, 8780],
  machineName3: [16628, 16652],
  // ポジション
  machinePositions: [740, 788, 836],
  // {1-3}機目がどの機体を登録しているか
  whichMachine1: [736, 737],
  whichMachine2: [784, 785],
  whichMachine3: [832, 833],
  // エンブレムのカラーパレット
  colorPalette: [
    [576, 580],
    [580, 584],
    [584, 588],
    [588, 592],
    [592, 596],
    [596, 600],
    [600, 604],
    [604, 608],
    [608, 612],
    [612, 616],
    [616, 620],
    [620, 624],
    [624, 628],
    [628, 632],
    [632, 636],
    [636, 640]
  ],
  // エンブレムのデータ
  emblem: [64, 576]
};

export default map;
